#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrabChampions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Enum CrabChampions.ECrabAbilitySpawnType
// NumValues: 0x0003
enum class ECrabAbilitySpawnType : uint8
{
	Claw                                     = 0,
	AboveCrosshair                           = 1,
	ECrabAbilitySpawnType_MAX                = 2,
};

// Enum CrabChampions.ECrabBossPhase
// NumValues: 0x0004
enum class ECrabBossPhase : uint8
{
	PhaseOne                                 = 0,
	PhaseTwo                                 = 1,
	PhaseThree                               = 2,
	ECrabBossPhase_MAX                       = 3,
};

// Enum CrabChampions.ECrabCrystalDropType
// NumValues: 0x000A
enum class ECrabCrystalDropType : uint8
{
	None                                     = 0,
	Small                                    = 1,
	Medium                                   = 2,
	Large                                    = 3,
	Gigantic                                 = 4,
	SmallWithBonus                           = 5,
	MediumWithBonus                          = 6,
	LargeWithBonus                           = 7,
	GiganticWithBonus                        = 8,
	ECrabCrystalDropType_MAX                 = 9,
};

// Enum CrabChampions.ECrabDamageAreaType
// NumValues: 0x0007
enum class ECrabDamageAreaType : uint8
{
	None                                     = 0,
	Damage                                   = 1,
	Health                                   = 2,
	MaxHealth                                = 3,
	EnergyRing                               = 4,
	BlackHole                                = 5,
	ECrabDamageAreaType_MAX                  = 6,
};

// Enum CrabChampions.ECrabEQCType
// NumValues: 0x0005
enum class ECrabEQCType : uint8
{
	None                                     = 0,
	BestEnemyC                               = 1,
	BestEnemyCoreLoc                         = 2,
	BestFriendlyC                            = 3,
	ECrabEQCType_MAX                         = 4,
};

// Enum CrabChampions.ECrabHarvestAreaType
// NumValues: 0x0004
enum class ECrabHarvestAreaType : uint8
{
	None                                     = 0,
	Crystal                                  = 1,
	Revival                                  = 2,
	ECrabHarvestAreaType_MAX                 = 3,
};

// Enum CrabChampions.ECrabConfirmationPromptType
// NumValues: 0x0005
enum class ECrabConfirmationPromptType : uint8
{
	None                                     = 0,
	QuitToLobby                              = 1,
	BringPartyMembersToLobby                 = 2,
	QuitToDesktop                            = 3,
	ECrabConfirmationPromptType_MAX          = 4,
};

// Enum CrabChampions.ECrabInputDir
// NumValues: 0x0006
enum class ECrabInputDir : uint8
{
	None                                     = 0,
	Forward                                  = 1,
	Backward                                 = 2,
	Right                                    = 3,
	Left                                     = 4,
	ECrabInputDir_MAX                        = 5,
};

// Enum CrabChampions.ECrabBlockingHitState
// NumValues: 0x0003
enum class ECrabBlockingHitState : uint8
{
	Deflected                                = 0,
	Aborted                                  = 1,
	ECrabBlockingHitState_MAX                = 2,
};

// Enum CrabChampions.ECrabProjectileState
// NumValues: 0x0005
enum class ECrabProjectileState : uint8
{
	None                                     = 0,
	Pooled                                   = 1,
	Active                                   = 2,
	Exploded                                 = 3,
	ECrabProjectileState_MAX                 = 4,
};

// Enum CrabChampions.ECrabTurretType
// NumValues: 0x0007
enum class ECrabTurretType : uint8
{
	None                                     = 0,
	Sentry                                   = 1,
	Sniper                                   = 2,
	Mortar                                   = 3,
	Wave                                     = 4,
	Beam                                     = 5,
	ECrabTurretType_MAX                      = 6,
};

// Enum CrabChampions.ECrabTargetType
// NumValues: 0x0006
enum class ECrabTargetType : uint8
{
	None                                     = 0,
	Up                                       = 1,
	CurrentLoc                               = 2,
	PredictedLoc                             = 3,
	TelegraphedLoc                           = 4,
	ECrabTargetType_MAX                      = 5,
};

// Enum CrabChampions.ECrabEnemyBuff
// NumValues: 0x0009
enum class ECrabEnemyBuff : uint8
{
	None                                     = 0,
	Shielded                                 = 1,
	Healthy                                  = 2,
	Regenerating                             = 3,
	Angered                                  = 4,
	Frenzied                                 = 5,
	Speedy                                   = 6,
	Last                                     = 7,
	ECrabEnemyBuff_MAX                       = 8,
};

// Enum CrabChampions.ECrabEnemyMovementType
// NumValues: 0x0005
enum class ECrabEnemyMovementType : uint8
{
	None                                     = 0,
	MoveDirectlyToEnemy                      = 1,
	MoveToPredictedEnemyLoc                  = 2,
	MoveToRangedActionLoc                    = 3,
	ECrabEnemyMovementType_MAX               = 4,
};

// Enum CrabChampions.ECrabEnemyCategory
// NumValues: 0x0007
enum class ECrabEnemyCategory : uint8
{
	None                                     = 0,
	Easy                                     = 1,
	Medium                                   = 2,
	Hard                                     = 3,
	Elite                                    = 4,
	Boss                                     = 5,
	ECrabEnemyCategory_MAX                   = 6,
};

// Enum CrabChampions.ECrabBlessing
// NumValues: 0x0007
enum class ECrabBlessing : uint8
{
	None                                     = 0,
	Flawless                                 = 1,
	Rush                                     = 2,
	KnivesOut                                = 3,
	Harvest                                  = 4,
	Last                                     = 5,
	ECrabBlessing_MAX                        = 6,
};

// Enum CrabChampions.ECrabChallengeModifier
// NumValues: 0x0014
enum class ECrabChallengeModifier : uint8
{
	None                                     = 0,
	OneHit                                   = 1,
	NoHealing                                = 2,
	MirroredProjectiles                      = 3,
	Shrapnel                                 = 4,
	HomingThorns                             = 5,
	HomingBarrels                            = 6,
	ElementalExplosions                      = 7,
	EnergyRings                              = 8,
	SpikeStrikes                             = 9,
	TwinnedEnemies                           = 10,
	ArmoredEnemies                           = 11,
	SpeedyEnemies                            = 12,
	IcyEnemies                               = 13,
	ExplosiveEnemies                         = 14,
	BarrelRain                               = 15,
	LandmineRain                             = 16,
	MeteorShower                             = 17,
	Last                                     = 18,
	ECrabChallengeModifier_MAX               = 19,
};

// Enum CrabChampions.ECrabContractType
// NumValues: 0x000A
enum class ECrabContractType : uint8
{
	None                                     = 0,
	TimeTrial                                = 1,
	NoHeals                                  = 2,
	Pacifist                                 = 3,
	ShieldedElite                            = 4,
	Zombies                                  = 5,
	Clones                                   = 6,
	Chaos                                    = 7,
	Last                                     = 8,
	ECrabContractType_MAX                    = 9,
};

// Enum CrabChampions.ECrabIslandType
// NumValues: 0x0012
enum class ECrabIslandType : uint8
{
	None                                     = 0,
	Lobby                                    = 1,
	NewRun                                   = 2,
	ContinueRun                              = 3,
	Arena                                    = 4,
	Horde                                    = 5,
	Demolition                               = 6,
	Parkour                                  = 7,
	Shop                                     = 8,
	Elite                                    = 9,
	Boss                                     = 10,
	Biome                                    = 11,
	CrabIsland                               = 12,
	Loop                                     = 13,
	Arcade                                   = 14,
	Holdout                                  = 15,
	Duel                                     = 16,
	ECrabIslandType_MAX                      = 17,
};

// Enum CrabChampions.ECrabRank
// NumValues: 0x0009
enum class ECrabRank : uint8
{
	None                                     = 0,
	Bronze                                   = 1,
	Silver                                   = 2,
	Gold                                     = 3,
	Sapphire                                 = 4,
	Emerald                                  = 5,
	Ruby                                     = 6,
	Diamond                                  = 7,
	ECrabRank_MAX                            = 8,
};

// Enum CrabChampions.ECrabDifficultyModifier
// NumValues: 0x000C
enum class ECrabDifficultyModifier : uint8
{
	LockedSlots                              = 0,
	BuffedEnemies                            = 1,
	ResurrectingEnemies                      = 2,
	ExpensiveShops                           = 3,
	DoubleChallenge                          = 4,
	EvolvedEnemies                           = 5,
	AmbushingElites                          = 6,
	EternalPunishment                        = 7,
	UnfairBosses                             = 8,
	NoSafetyNet                              = 9,
	Last                                     = 10,
	ECrabDifficultyModifier_MAX              = 11,
};

// Enum CrabChampions.ECrabDifficulty
// NumValues: 0x0005
enum class ECrabDifficulty : uint8
{
	Easy                                     = 0,
	Normal                                   = 1,
	Nightmare                                = 2,
	UltraChaos                               = 3,
	ECrabDifficulty_MAX                      = 4,
};

// Enum CrabChampions.ECrabTotemType
// NumValues: 0x0014
enum class ECrabTotemType : uint8
{
	None                                     = 0,
	Cosmetics                                = 1,
	Difficulty                               = 2,
	Key                                      = 3,
	Multiplayer                              = 4,
	Health                                   = 5,
	Crystal                                  = 6,
	Chance                                   = 7,
	Gamble                                   = 8,
	Loot                                     = 9,
	Gold                                     = 10,
	Glass                                    = 11,
	Fuse                                     = 12,
	Greed                                    = 13,
	Random                                   = 14,
	Contract                                 = 15,
	XL                                       = 16,
	Reroll                                   = 17,
	Enhancement                              = 18,
	ECrabTotemType_MAX                       = 19,
};

// Enum CrabChampions.ECrabConsumableType
// NumValues: 0x0005
enum class ECrabConsumableType : uint8
{
	None                                     = 0,
	Armor                                    = 1,
	Crystal                                  = 2,
	Key                                      = 3,
	ECrabConsumableType_MAX                  = 4,
};

// Enum CrabChampions.ECrabRelicType
// NumValues: 0x0040
enum class ECrabRelicType : uint8
{
	None                                     = 0,
	RingOfVigor                              = 1,
	RingOfHealing                            = 2,
	RingOfArmor                              = 3,
	RingOfParrying                           = 4,
	RingOfHealthyTurrets                     = 5,
	AdrenalineAmulet                         = 6,
	RingOfDestruction                        = 7,
	AncientBlade                             = 8,
	PortalRing                               = 9,
	RingOfRevolution                         = 10,
	RingOfReloading                          = 11,
	CoralAmulet                              = 12,
	RubyDice                                 = 13,
	BlacksmithAmulet                         = 14,
	TonysRing                                = 15,
	ComboRing                                = 16,
	TonysAmulet                              = 17,
	EtherealArmor                            = 18,
	RingOfReinforcement                      = 19,
	RingOfDefense                            = 20,
	RingOfDeflection                         = 21,
	FullMetalJacket                          = 22,
	RingOfRepulsion                          = 23,
	RingOfPower                              = 24,
	TimeRing                                 = 25,
	RingOfFury                               = 26,
	RingOfWisdom                             = 27,
	RingOfPrecision                          = 28,
	IceRing                                  = 29,
	FireRing                                 = 30,
	LightningRing                            = 31,
	PoisonRing                               = 32,
	ArcaneRing                               = 33,
	ChaoticRing                              = 34,
	ElementalRing                            = 35,
	TurboRing                                = 36,
	AmmoRing                                 = 37,
	RingOfRocketJumping                      = 38,
	SkillRing                                = 39,
	DuplicationRing                          = 40,
	BlacksmithRing                           = 41,
	RingOfDividends                          = 42,
	RingOfValue                              = 43,
	RingOfRegeneratingArmor                  = 44,
	RingOfProtection                         = 45,
	RingOfSwiftness                          = 46,
	RingOfGravity                            = 47,
	RingOfLuck                               = 48,
	RecursiveRing                            = 49,
	GoldenArc                                = 50,
	PortalAmulet                             = 51,
	AbilityRing                              = 52,
	GoldRing                                 = 53,
	TonysCrown                               = 54,
	TwinRing                                 = 55,
	RingOfTankiness                          = 56,
	OverspillGoblet                          = 57,
	RingOfFavoritism                         = 58,
	HoarderBackpack                          = 59,
	UpgradeRing                              = 60,
	CursedRing                               = 61,
	RushedRing                               = 62,
	ECrabRelicType_MAX                       = 63,
};

// Enum CrabChampions.ECrabPerkType
// NumValues: 0x007C
enum class ECrabPerkType : uint8
{
	None                                     = 0,
	Mango                                    = 1,
	Fortitude                                = 2,
	ValuedCustomer                           = 3,
	PersonalSpace                            = 4,
	Bullseye                                 = 5,
	Banana                                   = 6,
	Endurance                                = 7,
	Regenerator                              = 8,
	Scavenger                                = 9,
	HardTarget                               = 10,
	Vitality                                 = 11,
	DamageCombo                              = 12,
	ElementalSpecialist                      = 13,
	ElementalExpert                          = 14,
	Sharpshooter                             = 15,
	HotShot                                  = 16,
	PowerPunch                               = 17,
	CriticalThinking                         = 18,
	CriticalArrow                            = 19,
	ChainReaction                            = 20,
	Efficiency                               = 21,
	Autoloader                               = 22,
	SonicBoom                                = 23,
	SpecialDelivery                          = 24,
	TonysBlackCard                           = 25,
	DangerClose                              = 26,
	EagleEye                                 = 27,
	PowerArmor                               = 28,
	Equalizer                                = 29,
	SpeedDemon                               = 30,
	Stamina                                  = 31,
	Slugger                                  = 32,
	ExplosiveArmor                           = 33,
	FlammableArmor                           = 34,
	PoisonousArmor                           = 35,
	Icebreaker                               = 36,
	HotSteam                                 = 37,
	ArcaneRift                               = 38,
	Frostbite                                = 39,
	BubblingAcid                             = 40,
	IceCold                                  = 41,
	Firestarter                              = 42,
	HighVoltage                              = 43,
	Toxic                                    = 44,
	PotentMagic                              = 45,
	CrystalCombo                             = 46,
	Snatcher                                 = 47,
	Paycheck                                 = 48,
	CrystalFertilizer                        = 49,
	Driller                                  = 50,
	StreamerLoot                             = 51,
	EnhancedTurrets                          = 52,
	TurboTurrets                             = 53,
	TurretFriendship                         = 54,
	DamageAura                               = 55,
	IceAura                                  = 56,
	FireAura                                 = 57,
	LightningAura                            = 58,
	PoisonAura                               = 59,
	OrbitingScythes                          = 60,
	CrimsonHaze                              = 61,
	Shockwave                                = 62,
	GrimReaper                               = 63,
	GraveDodger                              = 64,
	AmberResin                               = 65,
	Bulletproof                              = 66,
	TastyOrange                              = 67,
	SilverLining                             = 68,
	Checklist                                = 69,
	Assassin                                 = 70,
	Gemstone                                 = 71,
	Collector                                = 72,
	MoneyIsPower                             = 73,
	HealthIsPower                            = 74,
	SpeedIsPower                             = 75,
	MegaCrit                                 = 76,
	CriticalBlast                            = 77,
	LingeringFumes                           = 78,
	AllYouCanEat                             = 79,
	BigChests                                = 80,
	PerformanceBonus                         = 81,
	DoubleVision                             = 82,
	SturdyTotems                             = 83,
	BonusCrystals                            = 84,
	GoldCoating                              = 85,
	RareTreasure                             = 86,
	ExplodingEnemies                         = 87,
	FreezingEnemies                          = 88,
	FlammableEnemies                         = 89,
	ElectricEnemies                          = 90,
	PoisonousEnemies                         = 91,
	FaultyChests                             = 92,
	CrystalAsteroids                         = 93,
	BonusChests                              = 94,
	CarePackage                              = 95,
	LevelUp                                  = 96,
	DivineBlessing                           = 97,
	CriticalLightning                        = 98,
	IceDash                                  = 99,
	LightningDash                            = 100,
	DaggerDash                               = 101,
	Powerslide                               = 102,
	StormCloud                               = 103,
	LeapOfFaith                              = 104,
	Bribe                                    = 105,
	DoubleTrouble                            = 106,
	Juggernaut                               = 107,
	BigBones                                 = 108,
	GlassCannon                              = 109,
	DamageSeeker                             = 110,
	BruteForce                               = 111,
	ThinkFast                                = 112,
	MetalClaw                                = 113,
	UpTheAnte                                = 114,
	Untouchable                              = 115,
	SlipperySlope                            = 116,
	DoubleEdgedSword                         = 117,
	Workaholic                               = 118,
	RisingStar                               = 119,
	LimitedLoot                              = 120,
	FlashSale                                = 121,
	HighRoller                               = 122,
	ECrabPerkType_MAX                        = 123,
};

// Enum CrabChampions.ECrabMeleeModType
// NumValues: 0x000E
enum class ECrabMeleeModType : uint8
{
	None                                     = 0,
	Vampire                                  = 1,
	BigClaws                                 = 2,
	SharpClaws                               = 3,
	IronClaws                                = 4,
	TimeClaws                                = 5,
	Blender                                  = 6,
	IceClaws                                 = 7,
	FireClaws                                = 8,
	LightningClaws                           = 9,
	PoisonClaws                              = 10,
	ArcaneClaws                              = 11,
	Brawler                                  = 12,
	ECrabMeleeModType_MAX                    = 13,
};

// Enum CrabChampions.ECrabAbilityModType
// NumValues: 0x003E
enum class ECrabAbilityModType : uint8
{
	None                                     = 0,
	AcceleratingAbility                      = 1,
	LightExplosion                           = 2,
	GlueExplosion                            = 3,
	ChaoticExplosion                         = 4,
	BigAbility                               = 5,
	IronExplosion                            = 6,
	TimeExplosion                            = 7,
	ImplodingExplosion                       = 8,
	BiggerBoom                               = 9,
	WeakExplosion                            = 10,
	SlowExplosion                            = 11,
	HeatSink                                 = 12,
	BouncingExplosion                        = 13,
	DamageExplosion                          = 14,
	TripleAbility                            = 15,
	LayeredExplosion                         = 16,
	AuraExplosion                            = 17,
	BubbleBlast                              = 18,
	DaggerBlast                              = 19,
	FireworkExplosion                        = 20,
	ThornExplosion                           = 21,
	SparkExplosion                           = 22,
	ShrapnelExplosion                        = 23,
	BarrelExplosion                          = 24,
	LandmineExplosion                        = 25,
	ElementalExplosion                       = 26,
	PopcornExplosion                         = 27,
	GiantDrill                               = 28,
	LightningBeam                            = 29,
	PoisonVines                              = 30,
	ToxicCloud                               = 31,
	ArcaneRift                               = 32,
	ArtilleryStrike                          = 33,
	TurretExplosion                          = 34,
	SentryTurret                             = 35,
	SniperTurret                             = 36,
	Grenadier                                = 37,
	DamagingCast                             = 38,
	HealingCast                              = 39,
	SplitAbility                             = 40,
	TargetingExplosion                       = 41,
	CloneExplosion                           = 42,
	BombExplosion                            = 43,
	SpinningBlade                            = 44,
	SporeExplosion                           = 45,
	UltraMushroom                            = 46,
	ScytheVortex                             = 47,
	CrystalBarrage                           = 48,
	EnergyRing                               = 49,
	MOAB                                     = 50,
	StarfishExplosion                        = 51,
	IceExplosion                             = 52,
	FireExplosion                            = 53,
	LightningExplosion                       = 54,
	PoisonExplosion                          = 55,
	SpikeStrike                              = 56,
	CrystalStrike                            = 57,
	MortarTurret                             = 58,
	WaveTurret                               = 59,
	BeamTurret                               = 60,
	ECrabAbilityModType_MAX                  = 61,
};

// Enum CrabChampions.ECrabWeaponModType
// NumValues: 0x005D
enum class ECrabWeaponModType : uint8
{
	None                                     = 0,
	BouncingShot                             = 1,
	AcceleratingShot                         = 2,
	ZigZagShot                               = 3,
	SpiralShot                               = 4,
	SnakeShot                                = 5,
	ChaoticShot                              = 6,
	BoomerangShot                            = 7,
	OrbitingShot                             = 8,
	RecoilShot                               = 9,
	FastShot                                 = 10,
	BigMag                                   = 11,
	HighCaliber                              = 12,
	WindUp                                   = 13,
	SteadyShot                               = 14,
	TrickShot                                = 15,
	AerialShot                               = 16,
	GripTape                                 = 17,
	BlindFire                                = 18,
	TimeShot                                 = 19,
	TimeBolt                                 = 20,
	UltraShot                                = 21,
	SharpShot                                = 22,
	GlueShot                                 = 23,
	BigShot                                  = 24,
	StreakShot                               = 25,
	MagShot                                  = 26,
	Uppercut                                 = 27,
	HeavyShot                                = 28,
	HeavyHitter                              = 29,
	RapidFire                                = 30,
	LightShot                                = 31,
	EscalatingShot                           = 32,
	IceShot                                  = 33,
	FireShot                                 = 34,
	LightningShot                            = 35,
	PoisonShot                               = 36,
	ArcaneShot                               = 37,
	RandomShot                               = 38,
	ReloadArc                                = 39,
	LuckyShot                                = 40,
	TripleShot                               = 41,
	ArcShot                                  = 42,
	XShot                                    = 43,
	SplitShot                                = 44,
	ScatterShot                              = 45,
	TargetingShot                            = 46,
	LinkShot                                 = 47,
	DrillShot                                = 48,
	DoubleTap                                = 49,
	HealthShot                               = 50,
	MoneyShot                                = 51,
	DamageShot                               = 52,
	Supercharged                             = 53,
	Juiced                                   = 54,
	AuraShot                                 = 55,
	PiercingShot                             = 56,
	BubbleShot                               = 57,
	PopcornShot                              = 58,
	PumpkinShot                              = 59,
	DaggerArc                                = 60,
	PiercingWave                             = 61,
	ArcaneBlast                              = 62,
	ShotgunBlast                             = 63,
	MaceShot                                 = 64,
	FireworkShot                             = 65,
	ThornShot                                = 66,
	SparkShot                                = 67,
	Firepower                                = 68,
	SquareShot                               = 69,
	HomingShot                               = 70,
	SplashDamage                             = 71,
	ProximityBarrage                         = 72,
	HomingBlades                             = 73,
	BombShot                                 = 74,
	LandmineShot                             = 75,
	TorpedoShot                              = 76,
	FireballShot                             = 77,
	SharpenedAxe                             = 78,
	TriangleShot                             = 79,
	BeamShot                                 = 80,
	SporeShot                                = 81,
	IceStorm                                 = 82,
	FireStorm                                = 83,
	LightningStorm                           = 84,
	PoisonStorm                              = 85,
	IceStrike                                = 86,
	FireStrike                               = 87,
	LightningStrike                          = 88,
	PoisonStrike                             = 89,
	SpikeStrike                              = 90,
	DiceShot                                 = 91,
	ECrabWeaponModType_MAX                   = 92,
};

// Enum CrabChampions.ECrabMiscPickupType
// NumValues: 0x0005
enum class ECrabMiscPickupType : uint8
{
	None                                     = 0,
	StreamerLootUpgradePickup                = 1,
	AutoLootPickup                           = 2,
	InfinitePedestalPickup                   = 3,
	ECrabMiscPickupType_MAX                  = 4,
};

// Enum CrabChampions.ECrabCurrencyType
// NumValues: 0x0005
enum class ECrabCurrencyType : uint8
{
	Crystal                                  = 0,
	Key                                      = 1,
	Health                                   = 2,
	MaxHealth                                = 3,
	ECrabCurrencyType_MAX                    = 4,
};

// Enum CrabChampions.ECrabEnhancementType
// NumValues: 0x001D
enum class ECrabEnhancementType : uint8
{
	None                                     = 0,
	Bouncing                                 = 1,
	Accelerating                             = 2,
	Zigging                                  = 3,
	Spiraling                                = 4,
	Snaking                                  = 5,
	Returning                                = 6,
	Orbiting                                 = 7,
	Chipping                                 = 8,
	Sticky                                   = 9,
	Growing                                  = 10,
	Freezing                                 = 11,
	Flaming                                  = 12,
	Electrifying                             = 13,
	Toxifying                                = 14,
	Arcanifying                              = 15,
	Persisting                               = 16,
	Doubling                                 = 17,
	Targeting                                = 18,
	Damaging                                 = 19,
	Booming                                  = 20,
	Tripling                                 = 21,
	Splitting                                = 22,
	Scattering                               = 23,
	Expanding                                = 24,
	Homing                                   = 25,
	Endangering                              = 26,
	Random                                   = 27,
	ECrabEnhancementType_MAX                 = 28,
};

// Enum CrabChampions.ECrabEnhanceableType
// NumValues: 0x0005
enum class ECrabEnhanceableType : uint8
{
	NotEnhanceable                           = 0,
	Enhanceable                              = 1,
	EnhanceableNonElemental                  = 2,
	EnhanceableNonHoming                     = 3,
	ECrabEnhanceableType_MAX                 = 4,
};

// Enum CrabChampions.ECrabPickupTag
// NumValues: 0x000E
enum class ECrabPickupTag : uint8
{
	None                                     = 0,
	Healing                                  = 1,
	DamageOverTime                           = 2,
	Critical                                 = 3,
	Speed                                    = 4,
	Bounce                                   = 5,
	Ice                                      = 6,
	Fire                                     = 7,
	Lightning                                = 8,
	Poison                                   = 9,
	Arcane                                   = 10,
	Turret                                   = 11,
	Combo                                    = 12,
	ECrabPickupTag_MAX                       = 13,
};

// Enum CrabChampions.ECrabRarity
// NumValues: 0x0006
enum class ECrabRarity : uint8
{
	None                                     = 0,
	Common                                   = 1,
	Epic                                     = 2,
	Legendary                                = 3,
	Greed                                    = 4,
	ECrabRarity_MAX                          = 5,
};

// Enum CrabChampions.ECrabLootPool
// NumValues: 0x0016
enum class ECrabLootPool : uint8
{
	None                                     = 0,
	Damage                                   = 1,
	Critical                                 = 2,
	Elemental                                = 3,
	Speed                                    = 4,
	Luck                                     = 5,
	Health                                   = 6,
	Economy                                  = 7,
	Skill                                    = 8,
	Greed                                    = 9,
	Upgrade                                  = 10,
	Random                                   = 11,
	Anvil                                    = 12,
	RelicChest                               = 13,
	SpikedChest                              = 14,
	EpicChest                                = 15,
	LegendaryChest                           = 16,
	RegenerationChest                        = 17,
	KeyChest                                 = 18,
	Lesser                                   = 19,
	NoRelicsOrConsumables                    = 20,
	ECrabLootPool_MAX                        = 21,
};

// Enum CrabChampions.ECrabPickupType
// NumValues: 0x000C
enum class ECrabPickupType : uint8
{
	None                                     = 0,
	Weapon                                   = 1,
	Ability                                  = 2,
	Melee                                    = 3,
	WeaponMod                                = 4,
	AbilityMod                               = 5,
	MeleeMod                                 = 6,
	Perk                                     = 7,
	Relic                                    = 8,
	Consumable                               = 9,
	Random                                   = 10,
	ECrabPickupType_MAX                      = 11,
};

// Enum CrabChampions.ECrabLesserProjectileType
// NumValues: 0x002A
enum class ECrabLesserProjectileType : uint8
{
	None                                     = 0,
	Duplicate                                = 1,
	Generic                                  = 2,
	TimeBolt                                 = 3,
	UltraShot                                = 4,
	ReloadArc                                = 5,
	LinkShot                                 = 6,
	DrillShot                                = 7,
	BubbleShot                               = 8,
	PumpkinShot                              = 9,
	DaggerArc                                = 10,
	PiercingWave                             = 11,
	ArcaneBlast                              = 12,
	ShotgunBlast                             = 13,
	MaceShot                                 = 14,
	FireworkShot                             = 15,
	ThornShot                                = 16,
	SparkShot                                = 17,
	ProximityBarrage                         = 18,
	HomingBlade                              = 19,
	BombShot                                 = 20,
	TorpedoShot                              = 21,
	FireballShot                             = 22,
	SharpenedAxe                             = 23,
	TriangleShot                             = 24,
	BeamShot                                 = 25,
	BubbleBlast                              = 26,
	DaggerBlast                              = 27,
	FireworkExplosion                        = 28,
	ThornExplosion                           = 29,
	SparkExplosion                           = 30,
	SentryTurret                             = 31,
	SniperTurret                             = 32,
	CloneExplosion                           = 33,
	BombExplosion                            = 34,
	SpinningBlade                            = 35,
	MortarTurret                             = 36,
	WaveTurret                               = 37,
	BeamTurret                               = 38,
	OrbitingScythe                           = 39,
	DaggerDash                               = 40,
	ECrabLesserProjectileType_MAX            = 41,
};

// Enum CrabChampions.ECrabFormationType
// NumValues: 0x001A
enum class ECrabFormationType : uint8
{
	Single                                   = 0,
	Double                                   = 1,
	Triple                                   = 2,
	Quad                                     = 3,
	SmallCluster                             = 4,
	MediumCluster                            = 5,
	LargeCluster                             = 6,
	SmallArc                                 = 7,
	SmallArcTightSpread                      = 8,
	LargeArc                                 = 9,
	LargeArcTightSpread                      = 10,
	TripleArc                                = 11,
	Box                                      = 12,
	Triangle                                 = 13,
	X                                        = 14,
	Square                                   = 15,
	LargeSquare                              = 16,
	Circle                                   = 17,
	LargeCircle                              = 18,
	Line                                     = 19,
	Cross                                    = 20,
	Ring                                     = 21,
	MediumRing                               = 22,
	LargeRing                                = 23,
	Random                                   = 24,
	ECrabFormationType_MAX                   = 25,
};

// Enum CrabChampions.ECrabHitmarkerType
// NumValues: 0x0004
enum class ECrabHitmarkerType : uint8
{
	Quiet                                    = 0,
	Normal                                   = 1,
	Loud                                     = 2,
	ECrabHitmarkerType_MAX                   = 3,
};

// Enum CrabChampions.ECrabCrosshairType
// NumValues: 0x0007
enum class ECrabCrosshairType : uint8
{
	None                                     = 0,
	Cross                                    = 1,
	Circle                                   = 2,
	BrokenCircle                             = 3,
	Dot                                      = 4,
	SniperScope                              = 5,
	ECrabCrosshairType_MAX                   = 6,
};

// Enum CrabChampions.ECrabDamageHitType
// NumValues: 0x0007
enum class ECrabDamageHitType : uint8
{
	None                                     = 0,
	Armor                                    = 1,
	ArmorBreak                               = 2,
	Health                                   = 3,
	Crit                                     = 4,
	Elimination                              = 5,
	ECrabDamageHitType_MAX                   = 6,
};

// Enum CrabChampions.ECrabDebuffType
// NumValues: 0x0008
enum class ECrabDebuffType : uint8
{
	None                                     = 0,
	Ice                                      = 1,
	Fire                                     = 2,
	Lightning                                = 3,
	Poison                                   = 4,
	Arcane                                   = 5,
	Last                                     = 6,
	ECrabDebuffType_MAX                      = 7,
};

// Enum CrabChampions.ECrabDamageTagType
// NumValues: 0x0008
enum class ECrabDamageTagType : uint8
{
	None                                     = 0,
	CriticalHit                              = 1,
	DOT                                      = 2,
	HealthShot                               = 3,
	MoneyShot                                = 4,
	Endangering                              = 5,
	ArmorPenetration                         = 6,
	ECrabDamageTagType_MAX                   = 7,
};

// Enum CrabChampions.ECrabDamageType
// NumValues: 0x000E
enum class ECrabDamageType : uint8
{
	None                                     = 0,
	Radial                                   = 1,
	Ability                                  = 2,
	Melee                                    = 3,
	Lesser                                   = 4,
	Knockback                                = 5,
	DOT                                      = 6,
	Ice                                      = 7,
	Fire                                     = 8,
	Lightning                                = 9,
	Arcane                                   = 10,
	Hazard                                   = 11,
	Unblockable                              = 12,
	ECrabDamageType_MAX                      = 13,
};

// Enum CrabChampions.ECrabSpawnPointType
// NumValues: 0x0009
enum class ECrabSpawnPointType : uint8
{
	Player                                   = 0,
	Destructible                             = 1,
	Totem                                    = 2,
	Secret                                   = 3,
	Enemy                                    = 4,
	Reward                                   = 5,
	Portal                                   = 6,
	Shop                                     = 7,
	ECrabSpawnPointType_MAX                  = 8,
};

// Enum CrabChampions.ECrabBiome
// NumValues: 0x0006
enum class ECrabBiome : uint8
{
	None                                     = 0,
	Tropical                                 = 1,
	Arctic                                   = 2,
	Desert                                   = 3,
	Volcanic                                 = 4,
	ECrabBiome_MAX                           = 5,
};

// Enum CrabChampions.ECrabMatchState
// NumValues: 0x0009
enum class ECrabMatchState : uint8
{
	None                                     = 0,
	WaitingToStart                           = 1,
	PortalCountdown                          = 2,
	StartedIsland                            = 3,
	ClearedIsland                            = 4,
	AllPlayersEliminated                     = 5,
	GameOver                                 = 6,
	Restarting                               = 7,
	ECrabMatchState_MAX                      = 8,
};

// Enum CrabChampions.ECrabCosmeticType
// NumValues: 0x0003
enum class ECrabCosmeticType : uint8
{
	CrabSkin                                 = 0,
	WeaponSkin                               = 1,
	ECrabCosmeticType_MAX                    = 2,
};

// Enum CrabChampions.ECrabTintType
// NumValues: 0x0009
enum class ECrabTintType : uint8
{
	None                                     = 0,
	Red                                      = 1,
	Orange                                   = 2,
	Yellow                                   = 3,
	Green                                    = 4,
	Blue                                     = 5,
	Purple                                   = 6,
	Last                                     = 7,
	ECrabTintType_MAX                        = 8,
};

// Enum CrabChampions.ECrabShotSpawnType
// NumValues: 0x0003
enum class ECrabShotSpawnType : uint8
{
	Muzzle                                   = 0,
	AboveCrosshair                           = 1,
	ECrabShotSpawnType_MAX                   = 2,
};

// Enum CrabChampions.ECrabShotDirType
// NumValues: 0x0003
enum class ECrabShotDirType : uint8
{
	CameraDir                                = 0,
	LobDir                                   = 1,
	ECrabShotDirType_MAX                     = 2,
};

// Enum CrabChampions.ECrabFireMode
// NumValues: 0x0003
enum class ECrabFireMode : uint8
{
	Automatic                                = 0,
	Burst                                    = 1,
	ECrabFireMode_MAX                        = 2,
};

// Enum CrabChampions.ECrabTriggerChanceType
// NumValues: 0x0004
enum class ECrabTriggerChanceType : uint8
{
	NotChanceBased                           = 0,
	FullScalingTriggerChance                 = 1,
	HalfScalingTriggerChance                 = 2,
	ECrabTriggerChanceType_MAX               = 3,
};

// ScriptStruct CrabChampions.CrabCosmetic
// 0x0028 (0x0028 - 0x0000)
struct FCrabCosmetic final
{
public:
	ECrabCosmeticType                             CosmeticType;                                      // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CosmeticName;                                      // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CosmeticIcon;                                      // 0x0018(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                CosmeticObject;                                    // 0x0020(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCrabCosmetic) == 0x000008, "Wrong alignment on FCrabCosmetic");
static_assert(sizeof(FCrabCosmetic) == 0x000028, "Wrong size on FCrabCosmetic");
static_assert(offsetof(FCrabCosmetic, CosmeticType) == 0x000000, "Member 'FCrabCosmetic::CosmeticType' has a wrong offset!");
static_assert(offsetof(FCrabCosmetic, CosmeticName) == 0x000008, "Member 'FCrabCosmetic::CosmeticName' has a wrong offset!");
static_assert(offsetof(FCrabCosmetic, CosmeticIcon) == 0x000018, "Member 'FCrabCosmetic::CosmeticIcon' has a wrong offset!");
static_assert(offsetof(FCrabCosmetic, CosmeticObject) == 0x000020, "Member 'FCrabCosmetic::CosmeticObject' has a wrong offset!");

// ScriptStruct CrabChampions.CrabChallenge
// 0x0050 (0x0050 - 0x0000)
struct FCrabChallenge final
{
public:
	class FName                                   ChallengeID;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChallengeDescription;                              // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChallengeProgress;                                 // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChallengeGoal;                                     // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChallengeCompleted;                               // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCrabCosmetic                          CosmeticReward;                                    // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCrabChallenge) == 0x000008, "Wrong alignment on FCrabChallenge");
static_assert(sizeof(FCrabChallenge) == 0x000050, "Wrong size on FCrabChallenge");
static_assert(offsetof(FCrabChallenge, ChallengeID) == 0x000000, "Member 'FCrabChallenge::ChallengeID' has a wrong offset!");
static_assert(offsetof(FCrabChallenge, ChallengeDescription) == 0x000008, "Member 'FCrabChallenge::ChallengeDescription' has a wrong offset!");
static_assert(offsetof(FCrabChallenge, ChallengeProgress) == 0x000018, "Member 'FCrabChallenge::ChallengeProgress' has a wrong offset!");
static_assert(offsetof(FCrabChallenge, ChallengeGoal) == 0x00001C, "Member 'FCrabChallenge::ChallengeGoal' has a wrong offset!");
static_assert(offsetof(FCrabChallenge, bChallengeCompleted) == 0x000020, "Member 'FCrabChallenge::bChallengeCompleted' has a wrong offset!");
static_assert(offsetof(FCrabChallenge, CosmeticReward) == 0x000028, "Member 'FCrabChallenge::CosmeticReward' has a wrong offset!");

// ScriptStruct CrabChampions.ClientAuthoritativeMoveData
// 0x0050 (0x0050 - 0x0000)
struct FClientAuthoritativeMoveData final
{
public:
	struct FVector_NetQuantize10                  Location;                                          // 0x0000(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize10                  Velocity;                                          // 0x0018(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ControlRotation;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         MovementMode;                                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    BasedMovementBase;                                 // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BasedMovementBaseBoneName;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBasedHasRelativeRotation;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FClientAuthoritativeMoveData) == 0x000008, "Wrong alignment on FClientAuthoritativeMoveData");
static_assert(sizeof(FClientAuthoritativeMoveData) == 0x000050, "Wrong size on FClientAuthoritativeMoveData");
static_assert(offsetof(FClientAuthoritativeMoveData, Location) == 0x000000, "Member 'FClientAuthoritativeMoveData::Location' has a wrong offset!");
static_assert(offsetof(FClientAuthoritativeMoveData, Rotation) == 0x00000C, "Member 'FClientAuthoritativeMoveData::Rotation' has a wrong offset!");
static_assert(offsetof(FClientAuthoritativeMoveData, Velocity) == 0x000018, "Member 'FClientAuthoritativeMoveData::Velocity' has a wrong offset!");
static_assert(offsetof(FClientAuthoritativeMoveData, ControlRotation) == 0x000024, "Member 'FClientAuthoritativeMoveData::ControlRotation' has a wrong offset!");
static_assert(offsetof(FClientAuthoritativeMoveData, MovementMode) == 0x000030, "Member 'FClientAuthoritativeMoveData::MovementMode' has a wrong offset!");
static_assert(offsetof(FClientAuthoritativeMoveData, BasedMovementBase) == 0x000038, "Member 'FClientAuthoritativeMoveData::BasedMovementBase' has a wrong offset!");
static_assert(offsetof(FClientAuthoritativeMoveData, BasedMovementBaseBoneName) == 0x000040, "Member 'FClientAuthoritativeMoveData::BasedMovementBaseBoneName' has a wrong offset!");
static_assert(offsetof(FClientAuthoritativeMoveData, bBasedHasRelativeRotation) == 0x000048, "Member 'FClientAuthoritativeMoveData::bBasedHasRelativeRotation' has a wrong offset!");

// ScriptStruct CrabChampions.CrabEnemySpawnSettings
// 0x0028 (0x0028 - 0x0000)
struct FCrabEnemySpawnSettings final
{
public:
	int32                                         IslandToStartSpawningAt;                           // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlySpawnIfLooping;                               // 0x0004(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECrabIslandType>                       BannedIslandTypes;                                 // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bIsEvolvedEnemy;                                   // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsExplosiveEnemy;                                 // 0x0019(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnCost;                                         // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnWeight;                                       // 0x0020(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpawnLimit;                                        // 0x0024(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCrabEnemySpawnSettings) == 0x000008, "Wrong alignment on FCrabEnemySpawnSettings");
static_assert(sizeof(FCrabEnemySpawnSettings) == 0x000028, "Wrong size on FCrabEnemySpawnSettings");
static_assert(offsetof(FCrabEnemySpawnSettings, IslandToStartSpawningAt) == 0x000000, "Member 'FCrabEnemySpawnSettings::IslandToStartSpawningAt' has a wrong offset!");
static_assert(offsetof(FCrabEnemySpawnSettings, bOnlySpawnIfLooping) == 0x000004, "Member 'FCrabEnemySpawnSettings::bOnlySpawnIfLooping' has a wrong offset!");
static_assert(offsetof(FCrabEnemySpawnSettings, BannedIslandTypes) == 0x000008, "Member 'FCrabEnemySpawnSettings::BannedIslandTypes' has a wrong offset!");
static_assert(offsetof(FCrabEnemySpawnSettings, bIsEvolvedEnemy) == 0x000018, "Member 'FCrabEnemySpawnSettings::bIsEvolvedEnemy' has a wrong offset!");
static_assert(offsetof(FCrabEnemySpawnSettings, bIsExplosiveEnemy) == 0x000019, "Member 'FCrabEnemySpawnSettings::bIsExplosiveEnemy' has a wrong offset!");
static_assert(offsetof(FCrabEnemySpawnSettings, SpawnCost) == 0x00001C, "Member 'FCrabEnemySpawnSettings::SpawnCost' has a wrong offset!");
static_assert(offsetof(FCrabEnemySpawnSettings, SpawnWeight) == 0x000020, "Member 'FCrabEnemySpawnSettings::SpawnWeight' has a wrong offset!");
static_assert(offsetof(FCrabEnemySpawnSettings, SpawnLimit) == 0x000024, "Member 'FCrabEnemySpawnSettings::SpawnLimit' has a wrong offset!");

// ScriptStruct CrabChampions.CrabLightingPreset
// 0x00A0 (0x00A0 - 0x0000)
struct FCrabLightingPreset final
{
public:
	float                                         Weight;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     SkydomeMI;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkydomeRotation;                                   // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DLHeight;                                          // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DLRotation;                                        // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DLIntensity;                                       // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DLTint;                                            // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SLIntensity;                                       // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SLTint;                                            // 0x0034(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SLHemisphereTint;                                  // 0x0044(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SLMinOcclusion;                                    // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 SLOcclusionTint;                                   // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PPTemperature;                                     // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HFDensity;                                         // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HFHeightFalloff;                                   // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
